{
  "patientId": "GH88991",
  "demographics": {
    "name": "George Harris",
    "dob": "1958-10-05",
    "gender": "Male",
    "address": "44 Tree Lane, Anytown, USA, 12345",
    "phone": "555-8899",
    "insurance": "Humana - Policy #HUM-GH-98765",
    "referringPhysician": "Dr. Samuel Adams (Medical Oncology)",
    "emergencyContact": "Susan Harris (Wife) - 555-8890 (Relationship: Spouse). Primary contact for all medical updates.",
    "advanceDirectives": "Full Code (On File, verified 03/22/2025 during initial Rad Onc consult). Patient has designated healthcare proxy (wife).",
    "supportServices": "Smoking cessation resources provided (patient is a former smoker). Oncology Social Worker referral for emotional support and coping strategies. Pain management consult for optimization of pain control.",
    "mobility": "Ambulatory with occasional cane use for longer distances. ECOG Performance Status 2 (due to pain). KPS 70. Able to perform light daily activities. Severe low back pain is limiting ambulation without assistance."
  },
  "diagnosis": {
    "primary": "Metastatic Castration-Resistant Prostate Cancer (mCRPC)",
    "location": "L3 Vertebral Body (with mild epidural extension)",
    "overallStage": "Stage IV",
    "tnmStage": "mCRPC - Widespread osseous mets",
    "grade": "Gleason Score: 4 + 3 = 7 (initial diagnosis, Grade Group 3)",
    "datePathologicDiagnosis": "11/15/2024 (Bone Scan showing mets, confirmed by subsequent biopsy)",
    "tumorSize": "L3 lesion measures 3.2 cm (axial) x 2.8 cm (craniocaudal) on MRI. Overall extensive bony metastatic burden.",
    "vascularInvolvement": "No direct major vascular involvement by spinal lesion. No distant vascular compromise.",
    "pathologicStage": "Stage IV (mCRPC) - widespread osseous metastases.",
    "symptomsAtPresentation": "Severe low back pain (8/10), localized to L3 region, worse with movement and night pain. No new leg weakness, numbness, or bowel/bladder dysfunction (no definitive cord compression at presentation, but mild posterior bulging noted on MRI).",
    "pathologyFindings": [
      "Initial Prostate Biopsy (2019): Adenocarcinoma, Gleason 4+3=7 (Grade Group 3).",
      "L3 Bone Biopsy (03/20/2025): Adenocarcinoma, consistent with prostate primary. ERG positive, AR positive. Confirms metastatic disease."
    ],
    "relevantHistory": "History of Prostate Cancer, initially treated with Radical Prostatectomy (2020), then Salvage Pelvic Radiation Therapy (2022) for PSA recurrence. Has been on continuous Androgen Deprivation Therapy (ADT) since 2020. History of Hypertension (controlled with Lisinopril). Former smoker (quit 10 years ago, 30 pack-year history). No other significant medical history. Patient is a retired engineer.",
    "baselineStatus": "ECOG 2 (Ambulatory, but symptomatic from pain; KPS 70). Pain controlled with oral opioids. No neurologic deficits related to spinal cord compression. Bowel and bladder function normal. No weight loss.",
    "comorbidities": "Hypertension, former smoker, chronic low back pain related to degenerative disc disease (pre-existing)."
  },
  "treatmentPlan": {
    "radOnc": "Dr. Laura Fisher",
    "medOnc": "Dr. Samuel Adams",
    "planId": "GH88991_SpinePal",
    "treatmentSite": "L3 Vertebral Body (Painful Metastasis)",
    "intent": "Palliative (Pain control, prevention of progressive pain, potential fracture prevention, and prevention of spinal cord compression).",
    "modality": "External Beam Radiation Therapy (EBRT) - 3D-Conformal Radiation Therapy (3D-CRT)",
    "fractionation": "10 fx",
    "billingCodes": "77402, 77387, 77427",
    "rtRxDetails": "30 Gy / 10 fx (3 Gy/fx daily), delivered 5 days per week (Monday-Friday) over 2 weeks.",
    "targetVolumeSummary": "Planning Target Volume (PTV) encompassing the entire L3 vertebral body with 5mm margin, including mild epidural extension identified on MRI. Designed to cover tumor and a small margin of normal bone, respecting spinal cord constraints.",
    "techniqueSummary": "3D-CRT utilizing opposed Anterior-Posterior (AP) and Posterior-Anterior (PA) fields. Fields shaped by MLCs to conform to target. Standard photon energy (6MV) used. Daily kV imaging for setup verification.",
    "concurrentChemo": "Androgen Deprivation Therapy (ADT)",
    "detailedConcurrentChemo": "Continued ongoing Androgen Deprivation Therapy (ADT - Leuprolide injection every 3 months) managed by Medical Oncology. Last injection 03/01/2025. Patient to continue ADT indefinitely as this is castration-resistant disease.",
    "medications": [
      "Dexamethasone 4mg PO BID (started 03/18/2025 to reduce peritumoral edema and pain). Planned taper post-RT.",
      "Oxycodone 10mg PO every 4-6 hours PRN (for breakthrough pain). Scheduled pain medication discussed.",
      "Ondansetron 4mg PO PRN Nausea (low risk with spine RT, but available).",
      "Sennosides 8.6mg PO daily (stool softener) to counteract opioid-induced constipation.",
      "Calcium 1000mg + Vitamin D 800 IU daily (for bone health, lifelong)."
    ],
    "therapistAlerts": [
      "Patient presents with significant pain. Assist with transfers to/from treatment couch and ensure comfortable positioning on immobilization device. Minimize setup time.",
      "Monitor patient closely for any new or worsening neurological symptoms (e.g., leg weakness, numbness, bowel/bladder dysfunction) indicating potential cord compression. Report immediately.",
      "Assess pain levels daily and document. Communicate changes to nursing/physician for medication adjustment.",
      "Ensure consistent and reproducible setup using Vac-Lok bag and external skin marks. Daily kV imaging is critical for accurate spinal targeting.",
      "Patient is on Dexamethasone; monitor for steroid side effects (e.g., hyperglycemia, mood changes, fluid retention)."
    ],
    "treatmentFields": [
      {
        "fieldName": "AP Spine",
        "technique": "3D-CRT",
        "beamTypeDisplay": "STATIC (Static Photon)",
        "energyDisplay": "6X",
        "monitorUnits": 165,
        "doseRate": 600,
        "estimatedTime_min": 0.28,
        "wedgeInfo": "None",
        "bolusInfo": "None",
        "gantryAngle": 0,
        "collimatorAngle": 0,
        "couchAngle": 0,
        "couchCoordinates_cm": { "vertical": 23.0, "longitudinal": 105.0, "lateral": 100.0 },
        "pitchAngle": 0.0,
        "rollAngle": 0.0,
        "jawPositions_cm": { "X1": 5.0, "X2": 5.0, "Y1": 6.0, "Y2": 6.0 }
      },
      {
        "fieldName": "PA Spine",
        "technique": "3D-CRT",
        "beamTypeDisplay": "STATIC (Static Photon)",
        "energyDisplay": "6X",
        "monitorUnits": 170,
        "doseRate": 600,
        "estimatedTime_min": 0.29,
        "wedgeInfo": "None",
        "bolusInfo": "None",
        "gantryAngle": 180,
        "collimatorAngle": 0,
        "couchAngle": 0,
        "couchCoordinates_cm": { "vertical": 23.0, "longitudinal": 105.0, "lateral": 100.0 },
        "pitchAngle": 0.0,
        "rollAngle": 0.0,
        "jawPositions_cm": { "X1": 5.0, "X2": 5.0, "Y1": 6.0, "Y2": 6.0 }
      }
    ]
  },
  "radiationOncologyData": {
    "ctSimulation": {
      "setupInstructions": "Supine in custom VacLok bag, with knee sponge and ankle immobilization for comfort and stability. Arms crossed over chest. Patient instructed to breathe normally. SAD setup. External skin marks placed at isocenter projections. Align to 3-point tattoos placed at anterior mid-line, and bilateral lateral mid-axillary lines (at level of L3). Daily kV imaging required."
    },
    "treatmentDelivery": {
      "fractions": []
    }
  },
  "cptCharges": [
    { "code": "77290", "description": "Simulation, Complex (Spine RT)", "frequency": "Once (03/28/2025)" },
    { "code": "77334", "description": "Treatment device, Complex (VacLok bag, custom immobilization)", "frequency": "Once (Initial Setup)" },
    { "code": "77295", "description": "3D radiotherapy plan (for palliative spine)", "frequency": "Once (Per plan)" },
    { "code": "77402", "description": "Radiation treatment delivery, 2 fields (AP/PA fields)", "frequency": "Daily (10 fractions)" },
    { "code": "77387", "description": "Image Guided RT (IGRT) - Daily kV imaging", "frequency": "Daily (10 fractions)" },
    { "code": "77427", "description": "Radiation treatment management, 5 treatments", "frequency": "Twice (for 10 fractions course)" },
    { "code": "99214", "description": "Office or other outpatient visit, established patient (for weekly MD visits)", "frequency": "Weekly (2 visits during RT, as appropriate for side effects)" }
  ]
}
